# THIS FILE IS AUTOMATICALLY GENERATED
# Project: D:\Showcase-BLE-CarT-master\Showcase-BLE-CarT-master\ultrasone_extensie_uart.cydsn\ultrasone_extensie_uart.cyprj
# Date: Thu, 12 Dec 2019 00:08:45 GMT
#set_units -time ns
create_clock -name {Clock_1(FFB)} -period 1000 -waveform {0 500} [list [get_pins {ClockBlock/ff_div_8}]]
create_clock -name {Clock_2(FFB)} -period 10000 -waveform {0 5000} [list [get_pins {ClockBlock/ff_div_9}]]
create_clock -name {UART_1_SCBCLK(FFB)} -period 1083.3333333333333 -waveform {0 541.666666666667} [list [get_pins {ClockBlock/ff_div_3}]]
create_clock -name {CyRouted1} -period 41.666666666666664 -waveform {0 20.8333333333333} [list [get_pins {ClockBlock/dsi_in_0}]]
create_clock -name {CyILO} -period 31250 -waveform {0 15625} [list [get_pins {ClockBlock/ilo}]]
create_clock -name {CyLFClk} -period 31250 -waveform {0 15625} [list [get_pins {ClockBlock/lfclk}]]
create_clock -name {CyIMO} -period 41.666666666666664 -waveform {0 20.8333333333333} [list [get_pins {ClockBlock/imo}]]
create_clock -name {CyHFClk} -period 41.666666666666664 -waveform {0 20.8333333333333} [list [get_pins {ClockBlock/hfclk}]]
create_clock -name {CySysClk} -period 41.666666666666664 -waveform {0 20.8333333333333} [list [get_pins {ClockBlock/sysclk}]]
create_generated_clock -name {Clock_1} -source [get_pins {ClockBlock/hfclk}] -edges {1 25 49} [list]
create_generated_clock -name {Clock_2} -source [get_pins {ClockBlock/hfclk}] -edges {1 241 481} [list]
create_generated_clock -name {UART_1_SCBCLK} -source [get_pins {ClockBlock/hfclk}] -edges {1 27 53} -nominal_period 1083.3333333333333 [list]


# Component constraints for D:\Showcase-BLE-CarT-master\Showcase-BLE-CarT-master\ultrasone_extensie_uart.cydsn\TopDesign\TopDesign.cysch
# Project: D:\Showcase-BLE-CarT-master\Showcase-BLE-CarT-master\ultrasone_extensie_uart.cydsn\ultrasone_extensie_uart.cyprj
# Date: Thu, 12 Dec 2019 00:08:43 GMT
