# THIS FILE IS AUTOMATICALLY GENERATED
# Project: C:\Users\guido\Desktop\AN68272_2\UART Bootloader\PSoC 4 projects\UART_Bootloader.cydsn\UART_Bootloader.cyprj
# Date: Thu, 16 Nov 2017 14:58:11 GMT
#set_units -time ns
create_clock -name {UART_SCBCLK(FFB)} -period 1333.3333333333333 -waveform {0 666.666666666667} [list [get_pins {ClockBlock/ff_div_2}]]
create_clock -name {Clock(FFB)} -period 4000000 -waveform {0 2000000} [list [get_pins {ClockBlock/ff_div_8}]]
create_clock -name {CyRouted1} -period 41.666666666666664 -waveform {0 20.8333333333333} [list [get_pins {ClockBlock/dsi_in_0}]]
create_clock -name {CyILO} -period 31250 -waveform {0 15625} [list [get_pins {ClockBlock/ilo}]]
create_clock -name {CyLFCLK} -period 31250 -waveform {0 15625} [list [get_pins {ClockBlock/lfclk}]]
create_clock -name {CyIMO} -period 41.666666666666664 -waveform {0 20.8333333333333} [list [get_pins {ClockBlock/imo}]]
create_clock -name {CyHFCLK} -period 41.666666666666664 -waveform {0 20.8333333333333} [list [get_pins {ClockBlock/hfclk}]]
create_clock -name {CySYSCLK} -period 41.666666666666664 -waveform {0 20.8333333333333} [list [get_pins {ClockBlock/sysclk}]]
create_generated_clock -name {UART_SCBCLK} -source [get_pins {ClockBlock/hfclk}] -edges {1 33 65} [list]
create_generated_clock -name {Clock} -source [get_pins {ClockBlock/hfclk}] -edges {1 96001 192001} [list]


# Component constraints for C:\Users\guido\Desktop\AN68272_2\UART Bootloader\PSoC 4 projects\UART_Bootloader.cydsn\TopDesign\TopDesign.cysch
# Project: C:\Users\guido\Desktop\AN68272_2\UART Bootloader\PSoC 4 projects\UART_Bootloader.cydsn\UART_Bootloader.cyprj
# Date: Thu, 16 Nov 2017 14:58:09 GMT
