# THIS FILE IS AUTOMATICALLY GENERATED
# Project: F:\pxl\MC 2019-2020\ball_balans\ultrasoon_test.cydsn\ultrasoon_test.cyprj
# Date: Sat, 04 Jan 2020 14:57:15 GMT
#set_units -time ns
create_clock -name {ADC_intClock(FFB)} -period 416.66666666666663 -waveform {0 208.333333333333} [list [get_pins {ClockBlock/ff_div_7}]]
create_clock -name {Clock_2(FFB)} -period 1000 -waveform {0 500} [list [get_pins {ClockBlock/ff_div_8}]]
create_clock -name {Clock_1(FFB)} -period 10000 -waveform {0 5000} [list [get_pins {ClockBlock/ff_div_9}]]
create_clock -name {Clock_3(FFB)} -period 10000 -waveform {0 5000} [list [get_pins {ClockBlock/ff_div_10}]]
create_clock -name {UART_SCBCLK(FFB)} -period 708.33333333333326 -waveform {0 354.166666666667} [list [get_pins {ClockBlock/ff_div_3}]]
create_clock -name {CyRouted1} -period 41.666666666666664 -waveform {0 20.8333333333333} [list [get_pins {ClockBlock/dsi_in_0}]]
create_clock -name {CyILO} -period 31250 -waveform {0 15625} [list [get_pins {ClockBlock/ilo}]]
create_clock -name {CyLFClk} -period 31250 -waveform {0 15625} [list [get_pins {ClockBlock/lfclk}]]
create_clock -name {CyIMO} -period 41.666666666666664 -waveform {0 20.8333333333333} [list [get_pins {ClockBlock/imo}]]
create_clock -name {CyHFClk} -period 41.666666666666664 -waveform {0 20.8333333333333} [list [get_pins {ClockBlock/hfclk}]]
create_clock -name {CySysClk} -period 41.666666666666664 -waveform {0 20.8333333333333} [list [get_pins {ClockBlock/sysclk}]]
create_generated_clock -name {ADC_intClock} -source [get_pins {ClockBlock/hfclk}] -edges {1 11 21} -nominal_period 416.66666666666663 [list]
create_generated_clock -name {Clock_2} -source [get_pins {ClockBlock/hfclk}] -edges {1 25 49} [list]
create_generated_clock -name {Clock_1} -source [get_pins {ClockBlock/hfclk}] -edges {1 241 481} [list]
create_generated_clock -name {Clock_3} -source [get_pins {ClockBlock/hfclk}] -edges {1 241 481} [list]
create_generated_clock -name {UART_SCBCLK} -source [get_pins {ClockBlock/hfclk}] -edges {1 17 35} -nominal_period 708.33333333333326 [list]

set_false_path -from [get_pins {__ONE__/q}]

# Component constraints for F:\pxl\MC 2019-2020\ball_balans\ultrasoon_test.cydsn\TopDesign\TopDesign.cysch
# Project: F:\pxl\MC 2019-2020\ball_balans\ultrasoon_test.cydsn\ultrasoon_test.cyprj
# Date: Sat, 04 Jan 2020 14:57:10 GMT
