# THIS FILE IS AUTOMATICALLY GENERATED
# Project: D:\11700639\OneDrive - PXL\PXL 2EA\Sem1\MC\DMX Controller\SPI_Only.cydsn\SPI_Only.cyprj
# Date: Tue, 31 Dec 2019 10:34:16 GMT
#set_units -time ns
create_clock -name {SPI_SCBCLK(FFB)} -period 250 -waveform {0 125} [list [get_pins {ClockBlock/ff_div_2}]]
create_clock -name {CyRouted1} -period 41.666666666666664 -waveform {0 20.8333333333333} [list [get_pins {ClockBlock/dsi_in_0}]]
create_clock -name {CyILO} -period 31250 -waveform {0 15625} [list [get_pins {ClockBlock/ilo}]]
create_clock -name {CyLFClk} -period 31250 -waveform {0 15625} [list [get_pins {ClockBlock/lfclk}]]
create_clock -name {CyIMO} -period 41.666666666666664 -waveform {0 20.8333333333333} [list [get_pins {ClockBlock/imo}]]
create_clock -name {CyHFClk} -period 41.666666666666664 -waveform {0 20.8333333333333} [list [get_pins {ClockBlock/hfclk}]]
create_clock -name {CySysClk} -period 41.666666666666664 -waveform {0 20.8333333333333} [list [get_pins {ClockBlock/sysclk}]]
create_generated_clock -name {SPI_SCBCLK} -source [get_pins {ClockBlock/hfclk}] -edges {1 7 13} [list]


# Component constraints for D:\11700639\OneDrive - PXL\PXL 2EA\Sem1\MC\DMX Controller\SPI_Only.cydsn\TopDesign\TopDesign.cysch
# Project: D:\11700639\OneDrive - PXL\PXL 2EA\Sem1\MC\DMX Controller\SPI_Only.cydsn\SPI_Only.cyprj
# Date: Tue, 31 Dec 2019 10:34:08 GMT
